app/controllers/category_products_controller.rb

SELECT "category_products".* FROM "category_products"
---
  def index
    @category_products = CategoryProduct.all

INSERT INTO "category_products" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pizza"], ["description", "Pizza sabores"], ["created_at", "2018-08-11 02:34:21.686697"], ["updated_at", "2018-08-11 02:34:21.686697"]]
---
  def create
    @category_product = CategoryProduct.new(category_params)
    respond_to do |format|
      if @category_product.save

DELETE FROM "category_products" WHERE "category_products"."id" = $1  [["id", 2]]
---
  def destroy
    @category_product.destroy

SELECT  "category_products".* FROM "category_products" WHERE "category_products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_category_product
    @category_product = CategoryProduct.find(params[:id])