app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions"
---
  def index
    @position = Position.all

INSERT INTO "positions" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gerente"], ["description", "gerente restaurante"], ["created_at", "2018-04-13 03:02:04.382696"], ["updated_at", "2018-04-13 03:02:04.382696"]]
---
  def create
    @position = Position.new(position_params)

    respond_to do |format|
      if @position.save

UPDATE "positions" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "positions"."id" = $4  [["name", "ppppp"], ["description", "ooooo"], ["updated_at", "2018-08-06 23:17:24.216588"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @position.update(position_params)

DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 2]]
---
  def destroy
    @position.destroy

SELECT  "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_position
      @position = Position.find(params[:id])