app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "category_product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save